package com.example.jhouse_server.admin.board.dto

/**
 * =============================================================================================
 * AdminBoardDeleteList                -- 게시글 일괄 영구 삭제 처리 DTO
 * deleteBoardList                     -- 삭제할 게시글 ID
 * =============================================================================================
 */
data class AdminBoardDeleteList(
        var deleteBoardList: List<Long>?
)
/**
 * =============================================================================================
 * AdminBoardFixList                -- 게시글 일괄 고정 처리 DTO
 * fixBoardIds                      -- 고정할 게시글 ID
 * =============================================================================================
 */
data class AdminBoardFixList(
        val fixBoardIds : List<Long>?
)
/**
 * =============================================================================================
 * AdminBoardSearch                -- 게시글 검색 DTO
 * filter                          -- 검색 필터링
 * keyword                         -- 검색할 키워드
 * =============================================================================================
 */
data class AdminBoardSearch(
    val filter: BoardSearchFilter?,
    val keyword: String?
)
/**
 * =============================================================================================
 * ENUM CLASS
 * =============================================================================================
 */

/**
 * =============================================================================================
 * 게시글 검색 필터링 조건
 * =============================================================================================
 */
enum class BoardSearchFilter (val value: String){
    TITLE("게시물 제목"),
    CONTENT("게시물 내용"),
    WRITER("게시물 작성자");
}