package com.example.jhouse_server.admin.report.dto

/**
 * =============================================================================================
 * ReportSearch                -- 신고 유저 검색 요청 DTO
 * filter                      -- 검색 조건
 * keyword                     -- 키워드
 * =============================================================================================
 */
data class ReportSearch(
    val filter: AdminReportSearchFilter?,
    val keyword: String?
)
/**
 * =============================================================================================
 * ReportAgentList                -- 신고 유저 계정 정지 요청 DTO
 * agentIds                       -- 신고된 유저 ID
 * =============================================================================================
 */
data class ReportAgentList(
    val agentIds: List<Long>?
)
/**
 * =============================================================================================
 * ENUM CLASS
 * =============================================================================================
 */
enum class AdminReportSearchFilter(val value: String) {
    NICKNAME("닉네임")
}